// BlueprintGeneratedClass BP_sod_bld_tvn_ngs_upperfloor_dressing_01_a_frontend.BP_sod_bld_tvn_ngs_upperfloor_dressing_01_a_frontend_C
// Size: 0x4e8 (Inherited: 0x3c8)
struct ABP_sod_bld_tvn_ngs_upperfloor_dressing_01_a_frontend_C : AActor {
	struct UStaticMeshComponent* StaticMeshComponent0199; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0198; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0197; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0195; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0194; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0189; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0183; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0172; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0171; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0169; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0137; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0136; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0130; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0129; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0128; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0127; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0126; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0125; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0124; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0123; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0122; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0121; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent094; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent047; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMeshComponent034; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMeshComponent032; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMeshComponent029; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMeshComponent026; // 0x4a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent025; // 0x4a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent022; // 0x4b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent021; // 0x4b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0x4c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x4c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x4d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x4d8(0x08)
	struct USceneComponent* SharedRoot; // 0x4e0(0x08)

	void UserConstructionScript(); // Function BP_sod_bld_tvn_ngs_upperfloor_dressing_01_a_frontend.BP_sod_bld_tvn_ngs_upperfloor_dressing_01_a_frontend_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1e25660
};

