// BlueprintGeneratedClass BP_sod_bld_tvn_ngs_shell_01_a_frontend.BP_sod_bld_tvn_ngs_shell_01_a_frontend_C
// Size: 0xe28 (Inherited: 0x3c8)
struct ABP_sod_bld_tvn_ngs_shell_01_a_frontend_C : AActor {
	struct UStaticMeshComponent* StaticMesh30; // 0x3c8(0x08)
	struct UStaticMeshComponent* sod_bld_door_06_a; // 0x3d0(0x08)
	struct UStaticMeshComponent* sod_bld_wall_06_b; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMesh23; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMesh22; // 0x3e8(0x08)
	struct UStaticMeshComponent* sod_bld_ngstavern_upper_ceiling_01_a; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x400(0x08)
	struct UStaticMeshComponent* Shadowcaster2; // 0x408(0x08)
	struct UStaticMeshComponent* ShadowCaster; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x428(0x08)
	struct UStaticMeshComponent* sod_bld_floor_trim_03_a; // 0x430(0x08)
	struct UStaticMeshComponent* sod_bld_floor_trim_04_a1; // 0x438(0x08)
	struct UStaticMeshComponent* sod_bld_floor_trim_04_a; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x450(0x08)
	struct UStaticMeshComponent* sod_bld_floor_trim_02_a; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x460(0x08)
	struct UStaticMeshComponent* sod_bld_floor_trim_01_a; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0809; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0808; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0807; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0806; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0805; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0804; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0803; // 0x4a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0802; // 0x4a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0799; // 0x4b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0794; // 0x4b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0793; // 0x4c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0792; // 0x4c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0791; // 0x4d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0790; // 0x4d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0764; // 0x4e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0763; // 0x4e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0762; // 0x4f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0761; // 0x4f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0760; // 0x500(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0759; // 0x508(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0758; // 0x510(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0757; // 0x518(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0756; // 0x520(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0755; // 0x528(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0754; // 0x530(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0753; // 0x538(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0752; // 0x540(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0748; // 0x548(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0747; // 0x550(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0736; // 0x558(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0732; // 0x560(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0731; // 0x568(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0730; // 0x570(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0726; // 0x578(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0725; // 0x580(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0724; // 0x588(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0716; // 0x590(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0715; // 0x598(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0712; // 0x5a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0711; // 0x5a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0710; // 0x5b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0709; // 0x5b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0708; // 0x5c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0700; // 0x5c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0699; // 0x5d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0698; // 0x5d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0697; // 0x5e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0688; // 0x5e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0684; // 0x5f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0674; // 0x5f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0652; // 0x600(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0651; // 0x608(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0649; // 0x610(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0648; // 0x618(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0647; // 0x620(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0646; // 0x628(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0644; // 0x630(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0637; // 0x638(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0634; // 0x640(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0633; // 0x648(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0632; // 0x650(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0631; // 0x658(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0630; // 0x660(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0629; // 0x668(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0628; // 0x670(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0627; // 0x678(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0626; // 0x680(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0625; // 0x688(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0624; // 0x690(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0623; // 0x698(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0621; // 0x6a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0620; // 0x6a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0619; // 0x6b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0618; // 0x6b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0617; // 0x6c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0616; // 0x6c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0615; // 0x6d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0614; // 0x6d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0613; // 0x6e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0612; // 0x6e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0611; // 0x6f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0610; // 0x6f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0608; // 0x700(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0607; // 0x708(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0606; // 0x710(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0554; // 0x718(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0553; // 0x720(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0551; // 0x728(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0550; // 0x730(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0549; // 0x738(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0545; // 0x740(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0523; // 0x748(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0522; // 0x750(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0520; // 0x758(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0519; // 0x760(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0518; // 0x768(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0517; // 0x770(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0516; // 0x778(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0515; // 0x780(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0514; // 0x788(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0513; // 0x790(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0512; // 0x798(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0511; // 0x7a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0506; // 0x7a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0505; // 0x7b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0504; // 0x7b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0503; // 0x7c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0495; // 0x7c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0494; // 0x7d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0493; // 0x7d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0492; // 0x7e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0491; // 0x7e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0490; // 0x7f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0489; // 0x7f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0487; // 0x800(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0486; // 0x808(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0485; // 0x810(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0472; // 0x818(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0470; // 0x820(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0469; // 0x828(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0459; // 0x830(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0454; // 0x838(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0452; // 0x840(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0449; // 0x848(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0444; // 0x850(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0438; // 0x858(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0427; // 0x860(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0425; // 0x868(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0421; // 0x870(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0419; // 0x878(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0416; // 0x880(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0415; // 0x888(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0414; // 0x890(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0413; // 0x898(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0412; // 0x8a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0411; // 0x8a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0407; // 0x8b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0408; // 0x8b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0406; // 0x8c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0405; // 0x8c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0376; // 0x8d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0375; // 0x8d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0372; // 0x8e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0369; // 0x8e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0367; // 0x8f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0366; // 0x8f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0365; // 0x900(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0364; // 0x908(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0363; // 0x910(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0362; // 0x918(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0361; // 0x920(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0360; // 0x928(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0359; // 0x930(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0358; // 0x938(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0357; // 0x940(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0356; // 0x948(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0355; // 0x950(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0353; // 0x958(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0351; // 0x960(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0350; // 0x968(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0349; // 0x970(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0348; // 0x978(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0347; // 0x980(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0346; // 0x988(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0345; // 0x990(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0344; // 0x998(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0343; // 0x9a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0342; // 0x9a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0341; // 0x9b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0340; // 0x9b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0337; // 0x9c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0336; // 0x9c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0335; // 0x9d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0331; // 0x9d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0329; // 0x9e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0328; // 0x9e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0327; // 0x9f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0326; // 0x9f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0325; // 0xa00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0324; // 0xa08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0323; // 0xa10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0322; // 0xa18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0321; // 0xa20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0320; // 0xa28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0319; // 0xa30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0318; // 0xa38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0317; // 0xa40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0316; // 0xa48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0315; // 0xa50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0314; // 0xa58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0313; // 0xa60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0312; // 0xa68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0311; // 0xa70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0309; // 0xa78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0308; // 0xa80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0307; // 0xa88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0306; // 0xa90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0305; // 0xa98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0304; // 0xaa0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0303; // 0xaa8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0302; // 0xab0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0301; // 0xab8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0300; // 0xac0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0299; // 0xac8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0298; // 0xad0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0297; // 0xad8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0296; // 0xae0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0295; // 0xae8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0294; // 0xaf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0293; // 0xaf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0292; // 0xb00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0291; // 0xb08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0290; // 0xb10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0289; // 0xb18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0268; // 0xb20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0267; // 0xb28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0266; // 0xb30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0265; // 0xb38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0264; // 0xb40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0263; // 0xb48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0262; // 0xb50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0261; // 0xb58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0259; // 0xb60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0258; // 0xb68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0257; // 0xb70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0256; // 0xb78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0255; // 0xb80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0254; // 0xb88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0253; // 0xb90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0252; // 0xb98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0251; // 0xba0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0250; // 0xba8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0249; // 0xbb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0248; // 0xbb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0247; // 0xbc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0246; // 0xbc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0245; // 0xbd0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0244; // 0xbd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0243; // 0xbe0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0242; // 0xbe8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0241; // 0xbf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0240; // 0xbf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0239; // 0xc00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0238; // 0xc08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0237; // 0xc10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0236; // 0xc18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0235; // 0xc20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0234; // 0xc28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0233; // 0xc30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0232; // 0xc38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0205; // 0xc40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0204; // 0xc48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0203; // 0xc50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0190; // 0xc58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0189; // 0xc60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent099; // 0xc68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent098; // 0xc70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent097; // 0xc78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent059; // 0xc80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent058; // 0xc88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent057; // 0xc90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent054; // 0xc98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent053; // 0xca0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent052; // 0xca8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent051; // 0xcb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent050; // 0xcb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent049; // 0xcc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent048; // 0xcc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent047; // 0xcd0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent046; // 0xcd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent045; // 0xce0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent044; // 0xce8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent043; // 0xcf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent042; // 0xcf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent041; // 0xd00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent040; // 0xd08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent039; // 0xd10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent038; // 0xd18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent037; // 0xd20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent036; // 0xd28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent035; // 0xd30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent034; // 0xd38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent033; // 0xd40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent032; // 0xd48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent031; // 0xd50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent030; // 0xd58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent029; // 0xd60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent028; // 0xd68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent027; // 0xd70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent026; // 0xd78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent025; // 0xd80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent024; // 0xd88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent023; // 0xd90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent022; // 0xd98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent021; // 0xda0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent020; // 0xda8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent019; // 0xdb0(0x08)
	struct UDecalComponent* NewDecalComponent; // 0xdb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent018; // 0xdc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0xdc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0xdd0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0xdd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0xde0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0xde8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0xdf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0xdf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0xe00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0xe08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0xe10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0xe18(0x08)
	struct USceneComponent* SharedRoot; // 0xe20(0x08)

	void UserConstructionScript(); // Function BP_sod_bld_tvn_ngs_shell_01_a_frontend.BP_sod_bld_tvn_ngs_shell_01_a_frontend_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1e25660
};

