// BlueprintGeneratedClass BP_tavern_frontend_01_a.BP_tavern_frontend_01_a_C
// Size: 0x420 (Inherited: 0x3c8)
struct ABP_tavern_frontend_01_a_C : AActor {
	struct UStaticMeshComponent* StaticMesh; // 0x3c8(0x08)
	struct UStaticMeshComponent* trs_chest_coins_03_a; // 0x3d0(0x08)
	struct UStaticMeshComponent* trs_chest_01_c_vc; // 0x3d8(0x08)
	struct UStaticMeshComponent* trs_chest_01_b_vc; // 0x3e0(0x08)
	struct UStaticMeshComponent* trs_chest_01_d_vc; // 0x3e8(0x08)
	struct UStaticMeshComponent* trs_chest_01_a_vc; // 0x3f0(0x08)
	struct UStaticMeshComponent* shp_rope_coil_03_a3; // 0x3f8(0x08)
	struct UStaticMeshComponent* cmn_stool_01_a4; // 0x400(0x08)
	struct UStaticMeshComponent* shp_rope_coil_03_a; // 0x408(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a; // 0x410(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x418(0x08)

	void UserConstructionScript(); // Function BP_tavern_frontend_01_a.BP_tavern_frontend_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1e25660
};

